[
  {
    "start": 320,
    "end": 2560,
    "text": "-Okay. Michael, why don't you start us off?"
  },
  {
    "start": 2560,
    "end": 8480,
    "text": "-That wasn't much of an introduction. -Ladies and gentlemen,"
  },
  {
    "start": 8559,
    "end": 9840,
    "text": "your boss, Michael"
  },
  {
    "start": 9840,
    "end": 19985,
    "text": "Scott. Still lame. Okay. Alright. Thank you, Ryan, for that wonderful introduction."
  },
  {
    "start": 21905,
    "end": 34950,
    "text": "Okay. Today we're going to be talking about PowerPoint. PowerPoint. PowerPoint. PowerPoint."
  },
  {
    "start": 35350,
    "end": 56725,
    "text": "Yes, I forgot about Ryan's presentation and yes, it would have been nice to do well with the first presentation that he'd given me. But you know what else would have been nice? Winning the lottery. And the best way to start is to hit start, and up comes the toolbar. That's what she said."
  },
  {
    "start": 56725,
    "end": 77005,
    "text": "What we have to do here is go to run, and then you look up to PowerPoint, and we are in. We are going to register. You hit register. Updates are ready. I should update."
  },
  {
    "start": 80045,
    "end": 83165,
    "text": "Estimated time twelve minutes, so this should take about five or ten minutes."
  },
  {
    "start": 83325,
    "end": 88870,
    "text": "This is the first time you've opened PowerPoint. Why? -You didn't prepare a presentation at all, did you?"
  },
  {
    "start": 88870,
    "end": 89110,
    "text": "Know what?"
  },
  {
    "start": 89110,
    "end": 92390,
    "text": "I had a really rough night, and my boss can back me up on that."
  },
  {
    "start": 92390,
    "end": 96630,
    "text": "-I'm your boss. -My other boss, Mr. Figaro. -You have another job?"
  },
  {
    "start": 97030,
    "end": 103384,
    "text": "-What I do between 05:30 p. M. And one a. M. Is nobody's business but mine and my other businesses."
  },
  {
    "start": 103865,
    "end": 109784,
    "text": "-Are you going to waitress? -You cannot have a second job if it affects your work here."
  },
  {
    "start": 109784,
    "end": 116505,
    "text": "-It won't? -It did already. -Okay. Honestly, it is unlikely that I was gonna figure this out anyway."
  },
  {
    "start": 117510,
    "end": 124710,
    "text": "That is so funny. Why is Daryl here? He works in a warehouse. I invited him. It's not a party."
  },
  {
    "start": 124710,
    "end": 127350,
    "text": "Daryl, back downstairs. This isn't the information you need."
  },
  {
    "start": 127350,
    "end": 132415,
    "text": "This information here? Yeah. You're right. I don't need this. Okay."
  },
  {
    "start": 134575,
    "end": 136415,
    "text": "Hey. Come on."
  },
  {
    "start": 138015,
    "end": 139055,
    "text": "See you later tonight."
  },
  {
    "start": 139055,
    "end": 140254,
    "text": "I got plans later."
  },
  {
    "start": 140254,
    "end": 150550,
    "text": "Okay. Bye, honey. How long until you actually get this presentation ready?"
  },
  {
    "start": 150470,
    "end": 153750,
    "text": "Don't you do this presentation? Because I you know how to do it."
  },
  {
    "start": 153750,
    "end": 159910,
    "text": "What I really want, honestly Michael, is for you to know it so that you can communicate it to the people here, to your clients, to whomever."
  },
  {
    "start": 159910,
    "end": 166645,
    "text": "Okay. What? It's whoever not whomever. Not whomever. No whomever is never actually right."
  },
  {
    "start": 166645,
    "end": 168005,
    "text": "Well sometimes it's right."
  },
  {
    "start": 168005,
    "end": 171205,
    "text": "Michael is right. It's a made up word used to trick students."
  },
  {
    "start": 171205,
    "end": 175125,
    "text": "No. Actually whomever is the formal version of the word."
  },
  {
    "start": 175125,
    "end": 178319,
    "text": "Obviously it's a real word but I don't know when to use it correctly."
  },
  {
    "start": 178319,
    "end": 179280,
    "text": "Not a native speaker."
  },
  {
    "start": 179280,
    "end": 184799,
    "text": "I know what's right, but I'm not gonna say because you're all jerks who didn't come see my band last night."
  },
  {
    "start": 184799,
    "end": 186079,
    "text": "Do you really know which one is correct?"
  },
  {
    "start": 186079,
    "end": 186960,
    "text": "I don't know."
  },
  {
    "start": 187040,
    "end": 191355,
    "text": "It's whom when it's the object of the sentence and who when it's the subject. Subject. That sounds right."
  },
  {
    "start": 191355,
    "end": 192395,
    "text": "Well, sounds right but is it"
  },
  {
    "start": 192475,
    "end": 194155,
    "text": "How did Ryan use it as an object? As"
  },
  {
    "start": 194155,
    "end": 196155,
    "text": "an object. Ryan used me as an object."
  },
  {
    "start": 196235,
    "end": 197435,
    "text": "Is he writing about the"
  },
  {
    "start": 197515,
    "end": 198475,
    "text": "How did he use it again?"
  },
  {
    "start": 198475,
    "end": 203035,
    "text": "It was Ryan wanted Michael, the subject, to explain the computer system, the object."
  },
  {
    "start": 203100,
    "end": 203740,
    "text": "Thank you."
  },
  {
    "start": 203740,
    "end": 208860,
    "text": "To whomever, meaning us, the indirect object, which is the correct usage of the word."
  },
  {
    "start": 208860,
    "end": 214060,
    "text": "No one asked you anything ever, so whomever's name is Toby, why don't you take"
  },
  {
    "start": 214060,
    "end": 220355,
    "text": "a letter opener and stick it in your skull? Hey, this doesn't matter, and I don't even care. Michael, you quit the other job or you're fired here."
  }
]